usr.sbin/mountd/mountd.8
.\"	$NetBSD: mountd.8,v 1.19 1998/10/07 14:51:36 christos Exp $
.\"
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mountd.8	8.4 (Berkeley) 4/28/95
.\"
.Dd April 28, 1995
.Dt MOUNTD 8
.Os
.Sh NAME
.Nm mountd
.Nd service remote
.Tn NFS
mount requests
.Sh SYNOPSIS
.Nm
.Op Fl a Ar addr
.Op Fl p Ar port
.Op Fl dn
.Op Ar exportsfile
.Sh DESCRIPTION
.Nm
is the server for
.Tn NFS
mount requests from other client machines.
.Nm
listens for service requests to the service indicated in the
.Tn NFS
server specification; see
.%T "Network File System Protocol Specification" ,
RFC1094, Appendix A and
.%T "NFS: Network File System Version 3 Protocol Specification" ,
Appendix I.
.Pp
Options and operands available for
.Nm mountd :
.Bl -tag -width Ds
.It Fl d
Enable debugging mode.
.Nm
will not detach from the controlling terminal and will print
debugging messages to stderr.
.It Fl n
This flag used to indicate that clients were required to make requests
from reserved ports, but it is now no longer functional. It
is only provided for backwards compatibility. Requests
are checked for reserved ports on a per-export basis, see
.Xr exports 5 .
.It Fl a Ar addr
Specifies an alternative
.Ar addr Ns ess
that the server is to listen on; the default is
.Dv INADDR_ANY ,
meaning
.Sq all local addresses .
.It Fl p Ar port
Specifies an alternative
.Ar port
number that the server is to listen on; the default is for the OS to
assign one, in the reserved port range if possible, or any free port if
not.  (When
.Fl p
is used, the same port number is used for both TCP and UDP, which is
often not the case otherwise.)
.It Ar exportsfile
The
.Ar exportsfile
argument specifies an alternative location
for the exports file.
.El
.Pp
When
.Nm
is started,
it loads the export host addresses and options into the kernel
using the
.Xr mount 2
system call.
After changing the exports file,
a hangup signal should be sent to the
.Nm
daemon to get it to reload the export information.
After sending the SIGHUP
(kill \-s HUP `cat /var/run/mountd.pid`),
check the syslog output to see if
.Nm
logged any parsing errors in the exports file.
.Pp
After receiving SIGTERM,
.Nm
sends a broadcast request to remove the mount list from all the clients.
This can take a long time, since the broadcast request waits for each
client to respond.
.Sh FILES
.Bl -tag -width /var/run/mountd.pid -compact
.It Pa /etc/exports
the list of exported filesystems
.It Pa /var/run/mountd.pid
the pid of the currently running
.Nm
.El
.Sh SEE ALSO
.Xr nfsstat 1 ,
.Xr exports 5 ,
.Xr nfsd 8 ,
.Xr portmap 8 ,
.Xr showmount 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Bx 4.4 .
